import os

slovar = {'а':'a','б':'b','в':'v','г':'g','д':'d','е':'e','ё':'yo','ж':'zh','з':'z','и':'i','й':'y','к':'k','л':'l','м':'m','н':'n','о':'o','п':'p','р':'r','с':'s','т':'t','у':'u','ф':'f','х':'h','ц':'c','ч':'ch','ш':'sh','щ':'shch','ъ':'y','ы':'y','ь':"'",'э':'e','ю':'yu','я':'ya','А':'A','Б':'B','В':'V','Г':'G','Д':'D','Е':'E','Ё':'Yo','Ж':'Zh','З':'Z','И':'I','Й':'Y','К':'K','Л':'L','М':'M','Н':'N','О':'O','П':'P','Р':'R','С':'S','Т':'T','У':'U','Ф':'F','Х':'H','Ц':'Ts','Ч':'Ch','Ш':'Sh','Щ':'Shch','Ъ':'Y','Ы':'Y','Ь':"'",'Э':'E','Ю':'Yu','Я':'Ya', '(':'(', ')':')', '.':'.', 'p':'p', 'y':'y', 'r':'r', 'e':'e', 'n':'n', 'a':'a', 'm':'m', ' ':' ', '-':'-', '1':'1', '2':'2', '3':'3', 'N':'N', ':':':', 'L':'L', 'C':'C', 'A':'A'}

for root, dirs, files in os.walk("."):
    for file in files:
        if file.endswith(".py"):
            new_name = ""
            for letter in file:
                new_name += slovar[letter]
            os.rename(file, new_name)
            
            
